#1) შექმენით ერთი სია რომელშიც შეიტანთ სახელებს შემდეგ შექმენით მეორე სია რომელშიც იქნება ისევ სხვადასხვა სახელები გააერთიანეთ ეს ორი სია ჩაამატეთ 5 ინდექსზე ახალი სახელი დაითვალეთ გაერთიანებული სიის სიგრძე და დაითვალეთ თქვენი სახელი რამდენჯერ გვხვდება ამ სიაში, ასევე დაბეჭდეთ რომელ ინდექსზე დგას თქვენი სახელი 

list1 = ["ნიკა", "ნინი", "თენგიზი", "მარიამი", "ლევანი"]

list2 = ["გიორგი", "ანა", "ელენე", "დათო", "სოფო"]

merged_list = list1 + list2

new_name = "კატო"
merged_list.insert(5, new_name)

list_length = len(merged_list)

my_name_count = merged_list.count("კატო")

my_name_indices = [index for index, name in enumerate(merged_list) if name == "კატო"]

print("გაერთიანებული სიის სიგრძე:", list_length)
print("ჩემი სახელი სიაში გვხვდება იმდენჯერ:", my_name_count)
print("ჩემი სახელის ინდექსები:", my_name_indices)
