#     3) მომხმარებელს შემოატანინეთ რიცხვი შემდეგ კი მომხარებლის შემოტანილ რიცხვამდე დაბეჭდეთ ყველა რიცხვის საშუალო არითმეტიკული 
# მომხმარებლისგან რიცხვის მიღება
number = int(input("შეიტანეთ რიცხვი: "))

# ჯამი და რაოდენობის ჩაწერა
total_sum = 0
count = 0

# for loop-ის გამოყენება რიცხვების გასატარებლად
for i in range(1, number + 1):
    total_sum += i  # რიცხვის დამატება ჯამში
    count += 1  # რიცხვების რაოდენობის მატება

# საშუალო არითმეტიკული
average = total_sum / count

# დაბეჭდვა
print(f"რიცხვების საშუალო არითმეტიკული")