#15 ,15 , 16, 16, 16,16, 16, 16, 15, 17, 17, 17, 17, 19, 21, 21, 23, 25, 25,26, 32.ეს არის თქვენი ჯგუფის წევრების ასაკები, 

#დავალება:

#შექმენით პროგრამა რომელიც გამოითვლის ჯგუფის საშუალო ასაკს. 
#ასევე გამოითვალეთ ყველაზე ხშირად რომელი ასაკი გვხვდება

ages = [15, 15, 16, 16, 16, 16, 16, 16, 15, 17, 17, 17, 17, 19, 21, 21, 23, 25, 25, 26, 32]


average_age = sum(ages) / len(ages)


from collections import Counter
age_counts = Counter(ages)
most_common_age = age_counts.most_common(1)[0]  # (ასაკი, სიხშირე)

print("ჯგუფის საშუალო ასაკი:", round(average_age, 2))
print("ყველაზე ხშირად განმეორებადი ასაკი:", most_common_age[0], "რაც გვხვდება", most_common_age[1], "ჯერ")
